zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4hvms128k_56_qfn.h
    /* P4.1 */
    P4_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_1_MSC0_SENSE                 =  4,       /* msc[0].sense:44 */
    P4_1_MSC0_SHIELD                =  5,       /* msc[0].shield:44 */
    P4_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_1_CXPI_CXPI_TX0              =  8,       /* Digital Active - cxpi.cxpi_tx[0]:0 */
    P4_1_SCB0_UART_TX               = 10,       /* Digital Active - scb[0].uart_tx:1 */
    P4_1_TCPWM_LINE_COMPL4          = 11,       /* Digital Active - tcpwm.line_compl[4]:2 */
    P4_1_SCB2_SPI_MOSI              = 12,       /* Digital Deep Sleep - scb[2].spi_mosi */

    /* P4.2 */
    P4_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_2_MSC0_SENSE                 =  4,       /* msc[0].sense:43 */
    P4_2_MSC0_SHIELD                =  5,       /* msc[0].shield:43 */
    P4_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_2_CXPI_CXPI_EN0              =  8,       /* Digital Active - cxpi.cxpi_en[0]:0 */
    P4_2_SCB0_UART_RTS              = 10,       /* Digital Active - scb[0].uart_rts:1 */
    P4_2_TCPWM_LINE0                = 11,       /* Digital Active - tcpwm.line[0]:1 */
    P4_2_SCB2_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[2].spi_miso */

    /* P4.3 */
    P4_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_3_MSC0_SENSE                 =  4,       /* msc[0].sense:42 */
    P4_3_MSC0_SHIELD                =  5,       /* msc[0].shield:42 */
    P4_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_3_CXPI_CXPI_RX0              =  8,       /* Digital Active - cxpi.cxpi_rx[0]:3 */
    P4_3_LIN_LIN_TX0                =  9,       /* Digital Active - lin.lin_tx[0]:3 */
    P4_3_SCB0_UART_CTS              = 10,       /* Digital Active - scb[0].uart_cts:1 */
    P4_3_TCPWM_LINE_COMPL0          = 11,       /* Digital Active - tcpwm.line_compl[0]:1 */
    P4_3_SCB2_SPI_SELECT0           = 12,       /* Digital Deep Sleep - scb[2].spi_select0 */

    /* P4.4 */
    P4_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_4_MSC0_SENSE                 =  4,       /* msc[0].sense:41 */
    P4_4_MSC0_SHIELD                =  5,       /* msc[0].shield:41 */
    P4_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_4_CXPI_CXPI_TX0              =  8,       /* Digital Active - cxpi.cxpi_tx[0]:3 */
    P4_4_LIN_LIN_RX0                =  9,       /* Digital Active - lin.lin_rx[0]:3 */
    P4_4_PASS0_DSI_SAR_DATA_VALID   = 10,       /* Digital Active - pass[0].dsi_sar_data_valid */
    P4_4_TCPWM_LINE1                = 11,       /* Digital Active - tcpwm.line[1]:1 */
    P4_4_SCB2_SPI_SELECT1           = 12,       /* Digital Deep Sleep - scb[2].spi_select1 */

    /* P4.5 */
    P4_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_5_MSC0_SENSE                 =  4,       /* msc[0].sense:40 */
    P4_5_MSC0_SHIELD                =  5,       /* msc[0].shield:40 */
    P4_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_5_CXPI_CXPI_EN0              =  8,       /* Digital Active - cxpi.cxpi_en[0]:3 */
    P4_5_LIN_LIN_EN0                =  9,       /* Digital Active - lin.lin_en[0]:3 */
    P4_5_PASS0_DSI_SAR_SAMPLE_DONE  = 10,       /* Digital Active - pass[0].dsi_sar_sample_done */
    P4_5_TCPWM_LINE_COMPL1          = 11,       /* Digital Active - tcpwm.line_compl[1]:1 */
    P4_5_SCB2_SPI_SELECT2           = 12,       /* Digital Deep Sleep - scb[2].spi_select2 */
    P4_5_LPCOMP_COMP1               = 15,       /* Digital Deep Sleep - lpcomp.comp[1]:2 */

    /* P4.6 */
    P4_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_6_MSC0_SENSE                 =  4,       /* msc[0].sense:39 */
    P4_6_MSC0_SHIELD                =  5,       /* msc[0].shield:39 */
    P4_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_6_PASS0_TR_SAR_OUT           = 10,       /* Digital Active - pass[0].tr_sar_out */
    P4_6_TCPWM_LINE2                = 11,       /* Digital Active - tcpwm.line[2]:1 */
    P4_6_SCB2_SPI_SELECT3           = 12,       /* Digital Deep Sleep - scb[2].spi_select3 */
    P4_6_LPCOMP_COMP0               = 15,       /* Digital Deep Sleep - lpcomp.comp[0]:2 */

    /* P4.7 */
    P4_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_7_MSC0_SENSE                 =  4,       /* msc[0].sense:38 */
    P4_7_MSC0_SHIELD                =  5,       /* msc[0].shield:38 */
    P4_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_7_PASS0_DSI_SAR_DATA11       = 10,       /* Digital Active - pass[0].dsi_sar_data[11] */
    P4_7_TCPWM_LINE_COMPL2          = 11,       /* Digital Active - tcpwm.line_compl[2]:1 */

    /* P5.0 */
    P5_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_0_MSC0_SENSE                 =  4,       /* msc[0].sense:2 */
    P5_0_MSC0_SHIELD                =  5,       /* msc[0].shield:2 */
    P5_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_0_CXPI_CXPI_TX0              =  8,       /* Digital Active - cxpi.cxpi_tx[0]:1 */
    P5_0_LIN_LIN_TX0                =  9,       /* Digital Active - lin.lin_tx[0]:1 */
    P5_0_SCB1_UART_TX               = 10,       /* Digital Active - scb[1].uart_tx:1 */
    P5_0_TCPWM_LINE_COMPL0          = 11,       /* Digital Active - tcpwm.line_compl[0]:2 */
    P5_0_SCB1_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[1].spi_miso:0 */
    P5_0_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:1 */
    P5_0_LPCOMP_COMP0               = 15,       /* Digital Deep Sleep - lpcomp.comp[0]:0 */

    /* P5.1 */
    P5_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_1_MSC0_SENSE                 =  4,       /* msc[0].sense:3 */
    P5_1_MSC0_SHIELD                =  5,       /* msc[0].shield:3 */
    P5_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_1_CXPI_CXPI_RX0              =  8,       /* Digital Active - cxpi.cxpi_rx[0]:1 */
    P5_1_LIN_LIN_RX0                =  9,       /* Digital Active - lin.lin_rx[0]:1 */
    P5_1_SCB1_UART_RX               = 10,       /* Digital Active - scb[1].uart_rx:1 */
    P5_1_TCPWM_LINE0                = 11,       /* Digital Active - tcpwm.line[0]:2 */
    P5_1_SCB1_SPI_MOSI              = 12,       /* Digital Deep Sleep - scb[1].spi_mosi:0 */
    P5_1_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:1 */
    P5_1_LPCOMP_COMP1               = 15,       /* Digital Deep Sleep - lpcomp.comp[1]:0 */

    /* P5.2 */
    P5_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_2_MSC0_SENSE                 =  4,       /* msc[0].sense:4 */
    P5_2_MSC0_SHIELD                =  5,       /* msc[0].shield:4 */
    P5_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_2_CXPI_CXPI_EN0              =  8,       /* Digital Active - cxpi.cxpi_en[0]:2 */
    P5_2_LIN_LIN_EN0                =  9,       /* Digital Active - lin.lin_en[0]:2 */
    P5_2_SCB1_UART_TX               = 10,       /* Digital Active - scb[1].uart_tx:2 */
    P5_2_TCPWM_LINE_COMPL1          = 11,       /* Digital Active - tcpwm.line_compl[1]:2 */
    P5_2_SCB3_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[3].spi_miso */

    /* P5.3 */
    P5_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_3_MSC0_SENSE                 =  4,       /* msc[0].sense:5 */
    P5_3_MSC0_SHIELD                =  5,       /* msc[0].shield:5 */
    P5_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_3_CXPI_CXPI_TX0              =  8,       /* Digital Active - cxpi.cxpi_tx[0]:2 */
    P5_3_LIN_LIN_RX0                =  9,       /* Digital Active - lin.lin_rx[0]:2 */
    P5_3_SCB1_UART_RX               = 10,       /* Digital Active - scb[1].uart_rx:2 */
    P5_3_TCPWM_LINE1                = 11,       /* Digital Active - tcpwm.line[1]:2 */
    P5_3_SCB3_SPI_MOSI              = 12,       /* Digital Deep Sleep - scb[3].spi_mosi */

    /* P5.4 */
    P5_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_4_MSC0_SENSE                 =  4,       /* msc[0].sense:6 */
    P5_4_MSC0_SHIELD                =  5,       /* msc[0].shield:6 */
    P5_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_4_CXPI_CXPI_RX0              =  8,       /* Digital Active - cxpi.cxpi_rx[0]:2 */
    P5_4_LIN_LIN_TX0                =  9,       /* Digital Active - lin.lin_tx[0]:2 */
    P5_4_SCB1_UART_CTS              = 10,       /* Digital Active - scb[1].uart_cts:2 */
    P5_4_TCPWM_LINE_COMPL2          = 11,       /* Digital Active - tcpwm.line_compl[2]:2 */
    P5_4_SCB3_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[3].spi_clk */

    /* P5.5 */
    P5_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_5_MSC0_SENSE                 =  4,       /* msc[0].sense:7 */
    P5_5_MSC0_SHIELD                =  5,       /* msc[0].shield:7 */
    P5_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_5_SCB1_UART_RTS              = 10,       /* Digital Active - scb[1].uart_rts:2 */
    P5_5_TCPWM_LINE_COMPL2          = 11,       /* Digital Active - tcpwm.line_compl[2]:3 */
    P5_5_SCB3_SPI_SELECT0           = 12,       /* Digital Deep Sleep - scb[3].spi_select0 */

