zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4hvms128k_56_qfn.h
    /* P5.6 */
    P5_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_6_MSC0_SENSE                 =  4,       /* msc[0].sense:8 */
    P5_6_MSC0_SHIELD                =  5,       /* msc[0].shield:8 */
    P5_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_6_TCPWM_LINE2                = 11,       /* Digital Active - tcpwm.line[2]:3 */
    P5_6_SCB3_SPI_SELECT1           = 12,       /* Digital Deep Sleep - scb[3].spi_select1 */

    /* P5.7 */
    P5_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_7_MSC0_SENSE                 =  4,       /* msc[0].sense:9 */
    P5_7_MSC0_SHIELD                =  5,       /* msc[0].shield:9 */
    P5_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_7_SCB3_SPI_SELECT2           = 12,       /* Digital Deep Sleep - scb[3].spi_select2 */

    /* P6.0 */
    P6_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_0_MSC0_SENSE                 =  4,       /* msc[0].sense:46 */
    P6_0_MSC0_SHIELD                =  5,       /* msc[0].shield:46 */
    P6_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_0_SCB3_UART_TX               = 10,       /* Digital Active - scb[3].uart_tx */
    P6_0_TCPWM_LINE_COMPL5          = 11,       /* Digital Active - tcpwm.line_compl[5]:0 */

    /* P7.0 */
    P7_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_0_MSC0_SENSE                 =  4,       /* msc[0].sense:0 */
    P7_0_MSC0_SHIELD                =  5,       /* msc[0].shield:0 */
    P7_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_0_PASS0_DSI_CTB_CMP0         = 13,       /* Digital Deep Sleep - pass[0].dsi_ctb_cmp0 */

    /* P7.1 */
    P7_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_1_MSC0_SENSE                 =  4,       /* msc[0].sense:1 */
    P7_1_MSC0_SHIELD                =  5,       /* msc[0].shield:1 */
    P7_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_1_PASS0_DSI_CTB_CMP1         = 13        /* Digital Deep Sleep - pass[0].dsi_ctb_cmp1 */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC4HVMS128K_56_QFN_H_ */


/* [] END OF FILE */
